20240101124425-if_else_statement.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-07 Sat 17:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>if/else Statement</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">if/else Statement</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b42ce2">1. If/ Else Statement</a>
<ul>
<li><a href="#org08428ae">1.1. Common Pitfalls</a>
<ul>
<li><a href="#org78f9ea4">1.1.1. 1. Forgetting Necessary Braces</a></li>
<li><a href="#org71b0dab">1.1.2. 2. Wrong Semicolon at the <b>If</b> line</a></li>
<li><a href="#org932b591">1.1.3. 3. Redundant Testing of Boolean Values</a></li>
<li><a href="#orge8bbb3c">1.1.4. 4. Dangling Else ambiguity</a></li>
<li><a href="#org19b0508">1.1.5. 5. Equality Test of Two Floating-Point Values</a></li>
<li><a href="#orgb70fdf8">1.1.6. <span class="underline">Exam Trick</span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1b42ce2" class="outline-2">
<h2 id="org1b42ce2"><span class="section-number-2">1.</span> If/ Else Statement</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">if</span>(hourOfDay &lt; 11) {
    System.out.println(<span class="org-string">"Good Morning"</span>);
} <span class="org-keyword">else</span> <span class="org-keyword">if</span> (hourOfDay &lt; 15) {
    System.out.println(<span class="org-string">"Good Afternoon"</span>);
} <span class="org-keyword">else</span> {
    System.out.println(<span class="org-string">"Good Evening"</span>);
}
</pre>
</div>
</div>

<div id="outline-container-org08428ae" class="outline-3">
<h3 id="org08428ae"><span class="section-number-3">1.1.</span> Common Pitfalls</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org78f9ea4" class="outline-4">
<h4 id="org78f9ea4"><span class="section-number-4">1.1.1.</span> 1. Forgetting Necessary Braces</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
One area where the exam writers will try to trip you up is <b>If</b> <b>statements</b> without braces ({}):
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">if</span>(hourOfDay &lt; 11)
    System.out.println(<span class="org-string">"Good Morning"</span>);
    morningGreetingCount++;
</pre>
</div>
</div>
</div>

<div id="outline-container-org71b0dab" class="outline-4">
<h4 id="org71b0dab"><span class="section-number-4">1.1.2.</span> 2. Wrong Semicolon at the <b>If</b> line</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
This mistake is hard to find, because it is neither a <b>compile</b> error nor a <b>runtime</b> error; it is a <b>logic</b> error.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">if</span> (radius &gt;= 0); <span class="org-comment-delimiter">// </span><span class="org-comment">Note semicolon
</span>{
    area = radius * radius * PI;
    System.out.println(<span class="org-string">"The area "</span> + <span class="org-string">" is "</span> + area);
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Or
</span>
<span class="org-keyword">if</span> (radius &gt;= 0) { }; <span class="org-comment-delimiter">// </span><span class="org-comment">Note semicolon
</span>{
    area = radius * radius * PI;
    System.out.println(<span class="org-string">"The area "</span> + <span class="org-string">" is "</span> + area);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org932b591" class="outline-4">
<h4 id="org932b591"><span class="section-number-4">1.1.3.</span> 3. Redundant Testing of Boolean Values</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
To test whether a <code>boolean</code> variable is <b>true</b> or <b>false</b> in a test condition, it is redundant to use the <a href="20231231063730-equality_operators.html#ID-700147ef-38e8-47dc-bdda-f675917ae802">equality</a> testing operator like the code in <code>(a)</code>:
Instead, it is better to test the <code>boolean</code> variable <b>directly</b>, as shown in <code>(b)</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">(a)
</span><span class="org-keyword">if</span> (even == <span class="org-constant">true</span>)
System.out.println(<span class="org-string">"It is even."</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">(b)
</span><span class="org-keyword">if</span> (even)
System.out.println(<span class="org-string">"It is even."</span>);
</pre>
</div>
<p>
(Another good reason for doing this is to avoid errors that are difficult to detect. Using the <code>=</code> operator instead of the <code>==</code> operator to compare the equality of two items in a test condition is a common error)
It could lead to the following erroneous statement:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">if</span> (even = <span class="org-constant">true</span>)
System.out.println(<span class="org-string">"It is even."</span>);
</pre>
</div>

<p>
This statement does <b>not</b> have <b>compile</b> errors. It assigns <b>true</b> to <b>even</b>, so <b>even</b> is always <b>true</b>.
</p>
</div>
</div>

<div id="outline-container-orge8bbb3c" class="outline-4">
<h4 id="orge8bbb3c"><span class="section-number-4">1.1.4.</span> 4. Dangling Else ambiguity</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
The dangling <b>else</b> ambiguity happens when <b>nested</b> If statements don’t use braces, making it unclear which <b>if</b> an <b>else</b> belongs to.
In Java, the <b>else</b> is always matched with the nearest unmatched <b>if</b>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">int</span> <span class="org-variable-name">x</span> = 5;

<span class="org-keyword">if</span> (x &gt; 0)
    <span class="org-keyword">if</span> (x &gt; 10)
        System.out.println(<span class="org-string">"Greater than 10"</span>);
    <span class="org-keyword">else</span>
        System.out.println(<span class="org-string">"Positive but not greater than 10"</span>);
</pre>
</div>

<p>
The <b>else</b> pairs with <code>if (x &gt; 10)</code>, <b>not</b> <code>if (x &gt; 0)</code>.
</p>

<p>
Use braces to resolve ambiguity:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">if</span> (x &gt; 0) {
    <span class="org-keyword">if</span> (x &gt; 10) {
        System.out.println(<span class="org-string">"Greater than 10"</span>);
    } <span class="org-keyword">else</span> {
        System.out.println(<span class="org-string">"Positive but not greater than 10"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org19b0508" class="outline-4">
<h4 id="org19b0508"><span class="section-number-4">1.1.5.</span> 5. Equality Test of Two Floating-Point Values</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Testing two <b>floating-point</b> values (<code>float</code> or <code>double</code>) for equality using <code>==</code> is <b>unreliable</b> because of <b>rounding</b> and <b>precision</b> errors in binary representation.
</p>

<p>
Values that <b>should</b> be equal mathematically <b>may</b> <b>differ</b> <b>slightly</b> in <b>memory</b>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">double</span> <span class="org-variable-name">a</span> = 0.1 + 0.2;
<span class="org-type">double</span> <span class="org-variable-name">b</span> = 0.3;

System.out.println(a == b); <span class="org-comment-delimiter">// </span><span class="org-comment">false</span>
</pre>
</div>

<p>
Numbers like <code>0.1</code> and <code>0.2</code> <b>cannot</b> be represented exactly in binary <b>floating-point</b>, so the result contains errors.
</p>
</div>
<ol class="org-ol">
<li><a id="org04738a9"></a>Solution<br />
<div class="outline-text-5" id="text-1-1-5-1">
<p>
You can compare whether they are close enough by testing whether the <b>difference</b> of the two numbers is less than some <b>threshold</b>.
That is, two numbers <code>x</code> and <code>y</code> are very close if ∣x−y∣ &lt; e, for a very small value e. (<a href="20260125182448-epsilon.html#ID-39a343ca-b4ef-40f2-8751-fc1458db3596">Epsilon</a>)
</p>
</div>

<ol class="org-ol">
<li><a id="org13badaa"></a>Double<br />
<div class="outline-text-6" id="text-1-1-5-1-1">
<p>
e: <code>10^-14</code>
</p>
</div>
</li>

<li><a id="org021e9b8"></a>Float<br />
<div class="outline-text-6" id="text-1-1-5-1-2">
<p>
e: <code>10^-7</code>
</p>
</div>
</li>

<li><a id="org0aec7b4"></a>Example<br />
<div class="outline-text-6" id="text-1-1-5-1-3">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">final</span> <span class="org-type">double</span> <span class="org-variable-name">EPSILON</span> = 1E&#8722;14;

<span class="org-type">double</span> <span class="org-variable-name">x</span> = 1.0 &#8722; 0.1 &#8722; 0.1 &#8722; 0.1 &#8722; 0.1 &#8722; 0.1;

<span class="org-keyword">if</span> (Math.abs(x &#8722; 0.5) &lt; EPSILON)
    System.out.println(x + <span class="org-string">" is approximately 0.5"</span>);
</pre>
</div>

<p>
Will display <code>0.5000000000000001</code> is approximately <code>0.5</code>.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-orgb70fdf8" class="outline-4">
<h4 id="orgb70fdf8"><span class="section-number-4">1.1.6.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
Common way the exam may try to lead you astray is by providing code where the <code>boolean</code> expression inside the <code>if</code> statement is not actually a <code>boolean</code> expression:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">int</span> <span class="org-variable-name">hourOfDay</span> = 1;
<span class="org-keyword">if</span>(hourOfDay) { <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>...
}
</pre>
</div>

<p>
(This statement <b>may</b> be valid in some other <code>programming</code> and <code>scripting</code> languages, but <b>not</b> in Java, where <code>0</code> and <code>1</code> are <b>not</b> considered <code>boolean</code> values.)
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
